# 5**
# Написати скрипт який порахує кількість ключив хеша з назвою key без урахування його типу та реєстру, та виведе цю інформацію в консоль
# hash = {
#   1    => 2,
#   nil  => 3,
#  'kEy' => :value_1,
#  :key  => :value_2,
#   Key:    :value_3
# }

  hash = {
    1 => 2,
    nil  => 3,
    'kEy' => :value_1,
    :key => :value_2,
    Key: :value_3
   }
  
  # створюэмо змінну total, що має значення хешу, в якому відфільтровуємо ключі з ім"ям key та переводимо в строку, 
  # переводимо всі в нижній регістр, рахуємо та виводимо кількість
  
  total = hash.keys.filter{|key| key.to_s.downcase == 'key'}.size
  puts "Hash size - #{total} keys."